Контролируемые счета/example/9_MOV.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns5:UCBRUHeaders xmlns:ns5="urn:ucbru:gbo:v4" xmlns:ns6="urn:ucbru:gbo:v4:casa">
            <ns5:Correlation>
                <ns5:XRef>555987-12258877-25478</ns5:XRef>
            </ns5:Correlation>
            <ns5:Audit>
                <ns5:MessagePath>
                    <ns5:Step>
                        <ns5:Application.Module>PAYMENT_HUB</ns5:Application.Module>
                        <ns5:TimeStamp>2016-11-28T13:51:47.251Z</ns5:TimeStamp>
                    </ns5:Step>
                </ns5:MessagePath>
                <ns5:ProcessInfo>
                    <ns5:Name>PAYMENT_HUB</ns5:Name>
                    <ns5:InstanceId>555778-122877144123-789111</ns5:InstanceId>
                </ns5:ProcessInfo>
            </ns5:Audit>
				<ns5:Composite>
					<ns5:Orchestration>SERVICE_DR_FIRST_OPTIMISTIC</ns5:Orchestration>
				</ns5:Composite>
        </ns5:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:SCASAMovementCreate xmlns:ns2="urn:ucbru:gbo:v4:casa" xmlns="urn:ucbru:gbo:v4">
            <ns2:Movement>
                <ns2:RequestNumber>1</ns2:RequestNumber>
                <ns2:BlockReference>
                    <ns2:SystemCode>PHUB</ns2:SystemCode>
                    <ns2:BlockID>555002</ns2:BlockID>
                </ns2:BlockReference>
                <ns2:MovementReference>
                    <ns2:SystemCode>PHUB</ns2:SystemCode>
                    <ns2:MovementID>5550012</ns2:MovementID>
                </ns2:MovementReference>
                <ns2:CBAccount>30232810200014724287</ns2:CBAccount>
                <ns2:MovementAmount>15222</ns2:MovementAmount>
                <ns2:ObjectReference>555111</ns2:ObjectReference>
                <ns2:ExtModule>PHub1</ns2:ExtModule>
                <ns2:ExtOperationCode>PAY</ns2:ExtOperationCode>
                <ns2:Priority>5</ns2:Priority>
                <ns2:OperationTimestamp>2016-01-25T10:30:17Z</ns2:OperationTimestamp>
                <ns2:DrCr>D</ns2:DrCr>
                <ns2:Narrative>оепебнд опхмършу демефмшу япедярб янцкюямн пееярпнб нр 20150625 он днцнбнпс на хрб нр 27.07.2012. мдя ме накюцюеряъ</ns2:Narrative>
                <ns2:UseOverdraft>true</ns2:UseOverdraft>
                <ns2:IgnoreBalance>false</ns2:IgnoreBalance>
                <ns2:IgnoreBlockFlag>false</ns2:IgnoreBlockFlag>
                <ns2:ValueDate>2016-01-28</ns2:ValueDate>
                <ns2:ABSSpecificParameters>
                    <ns2:MIDASSpecificParameters>
                        <ns2:SPOS>PHUB</ns2:SPOS>
                        <ns2:OTRF>555112</ns2:OTRF>
                        <ns2:Department>ITD</ns2:Department>
                        <ns2:ProfitCenter/>
                        <ns2:BookCode/>
                        <ns2:PostingTrnTyp>92200</ns2:PostingTrnTyp>
                        <ns2:PostingNarrative>PH555111</ns2:PostingNarrative>
                        <ns2:ProjectTrnTyp>PH</ns2:ProjectTrnTyp>
                        <ns2:ProjectTrnNbr/>
                        <ns2:ProjectNarrative>PH555111</ns2:ProjectNarrative>
                    </ns2:MIDASSpecificParameters>
                </ns2:ABSSpecificParameters>
            </ns2:Movement>
			<ns2:Movement>
                <ns2:RequestNumber>2</ns2:RequestNumber>
                <ns2:MovementReference>
                    <ns2:SystemCode>PHUB</ns2:SystemCode>
                    <ns2:MovementID>5550014</ns2:MovementID>
                </ns2:MovementReference>
                <ns2:CBAccount>40817810000010696539</ns2:CBAccount>
                <ns2:MovementAmount>15222</ns2:MovementAmount>
                <ns2:ObjectReference>555111</ns2:ObjectReference>
                <ns2:ExtModule>PHub1</ns2:ExtModule>
                <ns2:ExtOperationCode>PAY</ns2:ExtOperationCode>
                <ns2:Priority>5</ns2:Priority>
                <ns2:OperationTimestamp>2016-01-25T10:30:17Z</ns2:OperationTimestamp>
                <ns2:DrCr>C</ns2:DrCr>
                <ns2:Narrative>оепебнд опхмършу демефмшу япедярб янцкюямн пееярпнб нр 20150625 он днцнбнпс на хрб нр 27.07.2012. мдя ме накюцюеряъ</ns2:Narrative>
                <ns2:UseOverdraft>true</ns2:UseOverdraft>
                <ns2:IgnoreBalance>false</ns2:IgnoreBalance>
                <ns2:IgnoreBlockFlag>false</ns2:IgnoreBlockFlag>
                <ns2:ValueDate>2016-01-28</ns2:ValueDate>
                <ns2:ABSSpecificParameters>
                    <ns2:MIDASSpecificParameters>
                        <ns2:SPOS>PHUB</ns2:SPOS>
                        <ns2:OTRF>555111</ns2:OTRF>
                        <ns2:Department>ITD</ns2:Department>
                        <ns2:ProfitCenter/>
                        <ns2:BookCode/>
                        <ns2:PostingTrnTyp>92100</ns2:PostingTrnTyp>
                        <ns2:PostingNarrative>PH555111</ns2:PostingNarrative>
                        <ns2:ProjectTrnTyp>PH</ns2:ProjectTrnTyp>
                        <ns2:ProjectTrnNbr/>
                        <ns2:ProjectNarrative>PH555111</ns2:ProjectNarrative>
                    </ns2:MIDASSpecificParameters>
                </ns2:ABSSpecificParameters>
            </ns2:Movement>
        </ns2:SCASAMovementCreate>
    </soapenv:Body>
</soapenv:Envelope>