Контролируемые счета/example/10_MOV_resp.xml

<soapenv:Envelope xmlns:gbo="urn:ucbru:gbo:v4" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><ns6:UCBRUHeaders xmlns:ns6="urn:ucbru:gbo:v4" xmlns:ns5="urn:ucbru:gbo:v4:casa"><ns6:Correlation><ns6:XRef>a619a8ba-f324-4163-bff0-fd9745600395</ns6:XRef></ns6:Correlation><ns6:Audit><ns6:MessagePath><ns6:Step><ns6:Application.Module>PAYMENT_HUB</ns6:Application.Module><ns6:TimeStamp>2015-11-26T11:59:03.644Z</ns6:TimeStamp></ns6:Step><ns6:Step><ns6:Application.Module>SCASABlockAmount.PreBlockCreate.RequestHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.138+03:00</ns6:TimeStamp><ns6:RoutingRole>START</ns6:RoutingRole><ns6:Comment/></ns6:Step><ns6:Step><ns6:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.140+03:00</ns6:TimeStamp><ns6:RoutingRole>START</ns6:RoutingRole><ns6:Comment>Start of message processing</ns6:Comment></ns6:Step><ns6:Step><ns6:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.142+03:00</ns6:TimeStamp><ns6:RoutingRole>ROUTE</ns6:RoutingRole><ns6:Comment>Routing by format accounts</ns6:Comment></ns6:Step><ns6:Step><ns6:Application.Module>SRVACC.MaAcPoBaQu.ABS1_ResponseHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.145+03:00</ns6:TimeStamp><ns6:RoutingRole>ROUTE</ns6:RoutingRole><ns6:Comment>Routing by cb accounts</ns6:Comment></ns6:Step><ns6:Step><ns6:Application.Module>SRVACC.MaAcPoBaQu.ABS2_ResponseHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.310+03:00</ns6:TimeStamp><ns6:RoutingRole>SUCCESS</ns6:RoutingRole><ns6:Comment>Finish of message processing</ns6:Comment></ns6:Step><ns6:Step><ns6:Application.Module>SCASABlockAmount.PreBlockCreate.MaAcPoBaQu_ResponseHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.314+03:00</ns6:TimeStamp><ns6:RoutingRole>ROUTE</ns6:RoutingRole><ns6:Comment>Маршрутизация к атомарному сервису</ns6:Comment></ns6:Step><ns6:Step><ns6:Application.Module>AMDSCASABlockAmount.PreBlockCreate.RequestHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:38.328+03:00</ns6:TimeStamp><ns6:RoutingRole>START</ns6:RoutingRole><ns6:Comment/></ns6:Step><ns6:Step><ns6:Application.Module>AMDSCASABlockAmount.PreBlockCreate.ResponseHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:40.460+03:00</ns6:TimeStamp><ns6:RoutingRole>SUCCESS</ns6:RoutingRole><ns6:Comment/></ns6:Step><ns6:Step><ns6:Application.Module>SCASABlockAmount.PreBlockCreate.ResponseHandler</ns6:Application.Module><ns6:VersionId>v4</ns6:VersionId><ns6:TimeStamp>2015-12-07T17:25:40.468+03:00</ns6:TimeStamp><ns6:RoutingRole>SUCCESS</ns6:RoutingRole><ns6:Comment></ns6:Comment></ns6:Step></ns6:MessagePath><ns6:ProcessInfo><ns6:Name>PAYMENT_HUB</ns6:Name><ns6:InstanceId>123-123-166-8797</ns6:InstanceId></ns6:ProcessInfo></ns6:Audit></ns6:UCBRUHeaders></soapenv:Header><soapenv:Body><gbo:ExtendedStatus><gbo:StatusDetails><gbo:Status>SUCCESS</gbo:Status><gbo:Description>Обработка запроса прошла успешно</gbo:Description><gbo:Source>MIDAS</gbo:Source><gbo:DateTime>2015-12-07T17:25:40.457992+03:00</gbo:DateTime></gbo:StatusDetails><gbo:StatusExtension><NS1:SCASABlockExtension xmlns:NS1="urn:ucbru:gbo:v4:casa"><NS1:Block><NS1:BlockReference><NS1:SystemCode>FlexteraPH</NS1:SystemCode><NS1:BlockId>777007</NS1:BlockId></NS1:BlockReference><NS1:BlockAmount>777.77</NS1:BlockAmount><NS1:BlockType>P</NS1:BlockType><NS1:ABSReference>ABolg0126080</NS1:ABSReference></NS1:Block></NS1:SCASABlockExtension></gbo:StatusExtension></gbo:ExtendedStatus></soapenv:Body></soapenv:Envelope>#@#@#<soapenv:Envelope xmlns:gbo="urn:ucbru:gbo:v4" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><ns5:UCBRUHeaders xmlns:ns5="urn:ucbru:gbo:v4" xmlns:ns6="urn:ucbru:gbo:v4:casa"><ns5:Correlation><ns5:XRef>6197a998-c8c9-4360-a85a-b2777744fd88</ns5:XRef></ns5:Correlation><ns5:Audit><ns5:MessagePath><ns5:Step><ns5:Application.Module>PAYMENT_HUB</ns5:Application.Module><ns5:TimeStamp>2015-11-26T12:18:23.490Z</ns5:TimeStamp></ns5:Step><ns5:Step><ns5:Application.Module>SCASABlockAmount.PreBlockAuthorize.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.815+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.818+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment>Start of message processing</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.819+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Routing by format accounts</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.ABS1_ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.822+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Routing by cb accounts</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.ABS2_ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.852+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment>Finish of message processing</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASABlockAmount.PreBlockAuthorize.MaAcPoBaQu_ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.857+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Маршрутизация к атомарному сервису</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>AMDSCASABlockAmount.PreBlockAuthorize.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:23.868+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>AMDSCASABlockAmount.PreBlockAuthorize.ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:24.807+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>SCASABlockAmount.PreBlockAuthorize.ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:26:24.815+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment></ns5:Comment></ns5:Step></ns5:MessagePath><ns5:ProcessInfo><ns5:Name>PAYMENT_HUB</ns5:Name><ns5:InstanceId>123-123-124-38666971</ns5:InstanceId></ns5:ProcessInfo></ns5:Audit></ns5:UCBRUHeaders></soapenv:Header><soapenv:Body><gbo:ExtendedStatus><gbo:StatusDetails><gbo:Status>SUCCESS</gbo:Status><gbo:Description>Обработка запроса прошла успешно</gbo:Description><gbo:Source>MIDAS</gbo:Source><gbo:DateTime>2015-12-07T17:26:24.804621+03:00</gbo:DateTime></gbo:StatusDetails><gbo:StatusExtension><NS1:SCASABlockExtension xmlns:NS1="urn:ucbru:gbo:v4:casa"><NS1:Block><NS1:BlockReference><NS1:SystemCode>FlexteraPH</NS1:SystemCode><NS1:BlockId>777007</NS1:BlockId></NS1:BlockReference><NS1:BlockAmount>777.77</NS1:BlockAmount><NS1:BlockType>A</NS1:BlockType><NS1:ABSReference>ABolg0126080</NS1:ABSReference></NS1:Block></NS1:SCASABlockExtension></gbo:StatusExtension></gbo:ExtendedStatus></soapenv:Body></soapenv:Envelope>#@#@#<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo4="urn:ucbru:gbo:v4"><soapenv:Header><ns5:UCBRUHeaders xmlns:ns5="urn:ucbru:gbo:v4" xmlns:ns6="urn:ucbru:gbo:v4:casa"><ns5:Correlation><ns5:XRef>12258877-45678</ns5:XRef></ns5:Correlation><ns5:Audit><ns5:MessagePath><ns5:Step><ns5:Application.Module>PAYMENT_HUB</ns5:Application.Module><ns5:TimeStamp>2015-11-26T13:51:47.251Z</ns5:TimeStamp></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.286+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.289+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment>Start of message processing</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.290+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Routing by format accounts</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.ABS1_ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.294+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Routing by cb accounts</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SRVACC.MaAcPoBaQu.ABS2_ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.315+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment>Finish of message processing</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.MaAcPoResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.318+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Route to CoordinatorHandler</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.CoordinatorHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.320+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Route to Send2ABS</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.Send2ABS_Request</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.322+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>AMDSMovementCreate.RequestHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:15.335+03:00</ns5:TimeStamp><ns5:RoutingRole>START</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>AMDSMovementCreate.ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:16.229+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment/></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.Send2ABS_Response</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:16.236+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Route to CoordinatorHandler</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.CoordinatorHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:16.239+03:00</ns5:TimeStamp><ns5:RoutingRole>ROUTE</ns5:RoutingRole><ns5:Comment>Route to ResponseHandler</ns5:Comment></ns5:Step><ns5:Step><ns5:Application.Module>SCASAMovementCreate.ResponseHandler</ns5:Application.Module><ns5:VersionId>v4</ns5:VersionId><ns5:TimeStamp>2015-12-07T17:27:16.242+03:00</ns5:TimeStamp><ns5:RoutingRole>SUCCESS</ns5:RoutingRole><ns5:Comment></ns5:Comment></ns5:Step></ns5:MessagePath><ns5:ProcessInfo><ns5:Name>PAYMENT_HUB</ns5:Name><ns5:InstanceId>122666644123-789111</ns5:InstanceId></ns5:ProcessInfo></ns5:Audit><ns5:Tools><ns5:Environment/></ns5:Tools><ns5:Composite><ns5:Orchestration>SERVICE_DR_FIRST_OPTIMISTIC</ns5:Orchestration></ns5:Composite></ns5:UCBRUHeaders></soapenv:Header><soapenv:Body><gbo4:ExtendedStatus><gbo4:StatusDetails><gbo4:Status>SUCCESS</gbo4:Status><gbo4:Description>Обработка запроса прошла успешно</gbo4:Description><gbo4:Source>SCASA</gbo4:Source><gbo4:Kind>SUCCESS</gbo4:Kind><gbo4:DateTime>2015-12-07T17:27:16.241843+03:00</gbo4:DateTime></gbo4:StatusDetails><gbo4:StatusExtension><NS1:SCASAMovementExtension xmlns:NS1="urn:ucbru:gbo:v4:casa"><NS1:Movement><NS1:BlockReference><NS1:SystemCode>FlexteraPH</NS1:SystemCode><NS1:BlockID>777007</NS1:BlockID></NS1:BlockReference><NS1:MovementReference><NS1:SystemCode>FlexteraPH</NS1:SystemCode><NS1:MovementID>789003</NS1:MovementID></NS1:MovementReference><NS1:ABSReference>AMolg0000085</NS1:ABSReference><NS1:ABS>MIDAS</NS1:ABS><NS1:CBAccount>40702810700010003896</NS1:CBAccount><NS1:Status>S</NS1:Status></NS1:Movement></NS1:SCASAMovementExtension></gbo4:StatusExtension></gbo4:ExtendedStatus></soapenv:Body></soapenv:Envelope>